// STL组成
容器/算法/迭代器/函数对象/适配器/内存分配器
// 头文件
// 尽量按照c++标准使用无扩展名的格式
<iterator>
<functional>
<vector>
<deque>
<list>
<queue>
<stack>
<set>
<map>
<algorithm>
<numeric>
<memory>
<utility>

/*****************************************************
**********************序列式容器***********************
*****************************************************/
// 数组容器
array<T,N>
//用法看例程
http://c.biancheng.net/view/6688.html

// 向量容器
vector<T>
// 双端队列容器
deque<T>
// 链表容器
list<T>
// 正向链表容器
forward_list<T>
// 容器适配器
stack<T>
queue<T>

// 常见函数成员(到这儿查吧)
http://c.biancheng.net/view/409.html

/*****************************************************
***********************排序容器***********************
*****************************************************/

/*****************************************************
***********************哈希容器***********************
*****************************************************/

/*****************************************************
************************迭代器************************
*****************************************************/
输入迭代器
输出迭代器
前向迭代器
双向迭代器
随机访问迭代器
